test/artillery/concurrency.test.script.yaml
config:
  target: "http://localhost:3000"
  phases:
    - arrivalRate: 30
      duration: 1
  payload:
    path: "data.csv"
    order: random
    delimiter: "|"
    skipHeader: true
    fields:
      - "symptoms"
      - "age_range"
scenarios:
  - flow: 
    - log: "증상 보고서 입력 POST 요청 시도"
    - post:
        url: "http://localhost:3000/report"
        json:
          symptoms: "{{symptoms}}"
          age_range: "{{age_range}}"
        capture:
          json: "$.report_id"
          as: "report_id"
    - log: "환자 이송 신청 POST 요청 시도"
    - post:
        url: "http://localhost:3000/request/{{report_id}}/101"