test/artillery/hospital-recommend.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
  payload:
    path: "concurrency.test.script.csv"
    order: sequence
    delimiter: "|"
    skipHeader: true
    fields:
      - "symptoms"
      - "age_range"
      - "patient_id"

scenarios:
  - flow:
    - log: "사용자가 증상 보고서를 입력 후 병원 추천 조회"
    - post:
        url: "http://localhost:3000/report"
        json:
          symptoms: "{{symptoms}}"
          age_range: "{{age_range}}"
        capture:
          json: "$.report_id"
          as: "report_id"
    - get:
        url: "http://localhost:3000/hospital/{{report_id}}"
        qs:
          latitude: 37.1
          longitude: 127.1
          radius: 30