test/artillery/hospital-recommend.yaml
config:
  target: "https://ksnx3684.shop"
  phases:
    - duration: 10
      arrivalRate: 2

scenarios:
  - flow:
    - log: "사용자가 증상 보고서를 입력 후 병원 추천"
    - post:
        url: "https://ksnx3684.shop/report"
        json:
          symptoms: "{{symptoms}}"
          age_range: "{{age_range}}"
        capture:
          json: "$.report_id"
          as: "report_id"
    - get:
        url: "/hospital/1"
        qs:
          latitude: 37.1
          longitude: 127.1
          radius: 30