test/artillery/report-detail.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
  payload:
    path: "report-detail.csv"
    skipHeader: false
    delimiter: ","
    loadAll: true
    fields:
      - "patient_id"
    
scenarios:
  - flow:
    - log: "사용자가 증상 보고서를 상세 조회"
    - get:
        url: "http://localhost:3000/report/{{patient_id}}"