test/artillery/report-update.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "report-update.csv"
    order: sequence
    delimiter: ","
    skipHeader: true
    fields:
      - "report_id"
      - "symptoms"
      - "age_range"
      - "up_symptoms"
      - "up_age_range"

scenarios:
  - flow:
    - log: "사용자가 증상 보고서를 입력 후 정보 수정"
    - post:
        url: "http://localhost:3000/report"
        json:
          symptoms: "{{symptoms}}"
          age_range: "{{age_range}}"
        capture:
          json: "$.report_id"
          as: "report_id"
    - patch:
        url: "http://localhost:3000/report/{{report_id}}"
        json:
          symptoms: "{{up_symptoms}}"
          age_range: "{{up_age_range}}"