test/artillery/withdraw-request.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "withdraw-request.csv"
    order: sequence
    delimiter: ","
    skipHeader: true
    fields:
      - "report_id"
      - "hospital_id"

scenarios:
  - flow:
    - log: "사용자가 이송 신청을 했다가 철회"
    - post:
        url: "http://localhost:3000/request/{{report_id}}/{{hospital_id}}"
    - delete:
        url: "http://localhost:3000/request/{{report_id}}"